
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ,Режим)

	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ЦеныКвартир
	Движения.ЦеныКвартир.Записывать = Истина;
	Для Каждого ТекСтрокаЦеныКвартир из ЦеныКвартир Цикл
		Движение = Движения.ЦеныКвартир.Добавить();
		Движение.Период = Дата;
		Движение.Квартира = ТекСтрокаЦеныКвартир.Квартира;
		Движение.ЦенаЗаСутки = ТекСтрокаЦеныКвартир.ЦенаЗаСутки;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
