#Область ПрограммныйИнтерфейс

 // ЦенаЗаСутки квартир.
// 
// Параметры:
//  Квартира - СправочникСсылка.Квартиры
//  Период - Дата, Неопределено - Период
// 
// Возвращаемое значение:
//  Число - ЦенаЗаСутки квартиры
//
Функция ЦенаКвартир(Квартира, Период = Неопределено) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Квартира", Квартира);
	
	РеквизитыЗаписи = РегистрыСведений.ЦеныКвартир.ПолучитьПоследнее(Период, Отбор);
	
	Возврат РеквизитыЗаписи.ЦенаЗаСутки;
	
КонецФункции

#КонецОбласти