
#Область ПрограммныйИнтерфейс

// Проверяет, что дата документа лежит между датой начала и датой окончания договора.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект - Документ объект
//  Отказ - Булево
Процедура ПроверитьДоговорВДокументе(ДокументОбъект, Отказ) Экспорт
	
	Договор = ДокументОбъект.Договор;
	Дата = ДокументОбъект.Дата;
	ДокументДатаНачала = ДокументОбъект.ДатаНачала;
	ДокументДатаОкончания = ДокументОбъект.ДатаОкончания;
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.ДатаНачала КАК ДатаНачала,
		|	Договоры.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка при получении реквизата договора";
		Сообщение.УстановитьДанные(ДокументОбъект);
		Сообщение.Поле = "Договор";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Дата < Выборка.ДатаНачала Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Дата документа не должна быть меньше даты договора";
		Сообщение.УстановитьДанные(ДокументОбъект);
		Сообщение.Поле = "Договор";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ДатаОкончания) И Дата > Выборка.ДатаОкончания Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Дата документа не должна быть больше даты окончания договора";
		Сообщение.УстановитьДанные(ДокументОбъект);
		Сообщение.Поле = "Договор";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если ДокументДатаНачала < Выборка.ДатаНачала Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Дата аренды не должна быть меньше даты договора";
		Сообщение.УстановитьДанные(ДокументОбъект);
		Сообщение.Поле = "Договор";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ДатаОкончания) И ДокументДатаНачала > Выборка.ДатаОкончания Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Дата аренды не должна быть больше даты окончания договора";
		Сообщение.УстановитьДанные(ДокументОбъект);
		Сообщение.Поле = "Договор";
		Сообщение.Сообщить();
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Выборка.ДатаОкончания) И ДокументДатаОкончания > Выборка.ДатаОкончания Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Дата окончания аренды не должна быть больше даты окончания договора";
		Сообщение.УстановитьДанные(ДокументОбъект);
		Сообщение.Поле = "Договор";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
