
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	РаботаСДоговорами.ПроверитьДоговорВДокументе(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)

	СформироватьДвиженияОстаткиТоваров(Отказ);
	
	ПроверитьПересечениеДатАренды(Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//СуммаДокумента = Недвижимость.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияОстаткиТоваров(Отказ)
	
	// регистр Продажи
	Движения.Продажи.Записывать = Истина;
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.Квартира = Квартира;
	Движение.ДатаНачала = ДатаНачала;
	Движение.ДатаОкончания = ДатаОкончания;
	Движение.Сумма = Сумма;
	
КонецПроцедуры

Процедура ПроверитьПересечениеДатАренды(Отказ)
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
        |ВЫБРАТЬ
        |   Продажи.Период КАК Период,
        |   Продажи.Квартира КАК Квартира,
        |   Продажи.ДатаНачала КАК ДатаНачала,
        |   Продажи.ДатаОкончания КАК ДатаОкончания
        |ИЗ
        |   РегистрНакопления.Продажи КАК Продажи
        |ГДЕ
        |   Продажи.Квартира = &Квартира
        |   И Продажи.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
        |   ИЛИ (Продажи.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания)
        |   ИЛИ (Продажи.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания)
        |   ИЛИ (&ДатаНачала МЕЖДУ Продажи.ДатаНачала И Продажи.ДатаОкончания)
        |   ИЛИ (&ДатаОкончания МЕЖДУ Продажи.ДатаНачала И Продажи.ДатаОкончания)";
    
    Запрос.УстановитьПараметр("Квартира", ЭтотОбъект.Квартира);
    Запрос.УстановитьПараметр("ДатаНачала", ЭтотОбъект.ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ЭтотОбъект.ДатаОкончания);
    
    Результат = Запрос.Выполнить();
    
    Если Не Результат.Пустой() Тогда
        Отказ = Истина;
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Квартира уже арендуется на указанные даты! (период: " + Формат(ЭтотОбъект.ДатаНачала, "ДФ=dd.MM.yyyy")
                + " – " + Формат(ЭтотОбъект.ДатаОкончания, "ДФ=dd.MM.yyyy") + ").";
        Сообщение.УстановитьДанные(ЭтотОбъект);
        Сообщение.Поле = "ДатаНачала";
        Сообщение.Сообщить();
    КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
