
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЦенаЗаСуткиПриИзменении(Элемент)
	
	РассчитатьСуммуСтроки();
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	РассчитатьСуммуСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	

	РассчитатьСуммуСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	
	Цена = ЦеныКвартирыВызовСервера.ЦенаКвартир(
		Объект.Квартира, Объект.Дата);
			
	Объект.ЦенаЗаСутки = Цена;
	
	РассчитатьСуммуСтроки();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки()
	Объект.Сумма = (Объект.ДатаОкончания - Объект.ДатаНачала)/24/60/60 * Объект.ЦенаЗаСутки;
КонецПроцедуры

#КонецОбласти